\timing on
\echo '=== APPLY INDEXES ==='

-- ============================================
-- TODO: Создайте индексы на основе ваших EXPLAIN ANALYZE
-- ============================================

-- Индекс 1
-- TODO:
-- CREATE INDEX ... ON ... USING BTREE (...);
-- Обоснование:
-- - какой запрос ускоряет
-- - почему выбран именно этот тип индекса

-- Индекс 2
-- TODO:
-- CREATE INDEX ... ON ... USING ... (...);
-- Обоснование:
-- - какой запрос ускоряет
-- - почему выбран именно этот тип индекса

-- Индекс 3
-- TODO:
-- CREATE INDEX ... ON ... USING ... (...);
-- Обоснование:
-- - какой запрос ускоряет
-- - почему выбран именно этот тип индекса

-- (Опционально) Частичный индекс / BRIN / составной индекс
-- TODO

-- Не забудьте обновить статистику после создания индексов
-- TODO:
-- ANALYZE;
